<template>
  <svg :width="computedWidth" :height="computedHeight" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path fill-rule="evenodd" clip-rule="evenodd"
      d="M10.5293 6.23204C10.6698 6.37266 10.7487 6.56328 10.7487 6.76204C10.7487 6.96079 10.6698 7.15141 10.5293 7.29204L5.80934 12.012H19.9993C20.1983 12.012 20.389 12.0911 20.5297 12.2317C20.6703 12.3724 20.7493 12.5631 20.7493 12.762C20.7493 12.9609 20.6703 13.1517 20.5297 13.2924C20.389 13.433 20.1983 13.512 19.9993 13.512H5.80934L10.5293 18.232C10.603 18.3007 10.6621 18.3835 10.7031 18.4755C10.7441 18.5675 10.7662 18.6668 10.7679 18.7675C10.7697 18.8682 10.7512 18.9682 10.7135 19.0616C10.6757 19.155 10.6196 19.2399 10.5484 19.3111C10.4772 19.3823 10.3923 19.4384 10.2989 19.4762C10.2055 19.5139 10.1055 19.5324 10.0048 19.5306C9.90412 19.5288 9.8048 19.5068 9.7128 19.4658C9.6208 19.4248 9.538 19.3657 9.46934 19.292L3.46934 13.292C3.32889 13.1514 3.25 12.9608 3.25 12.762C3.25 12.5633 3.32889 12.3727 3.46934 12.232L9.46934 6.23204C9.60997 6.09158 9.80059 6.0127 9.99934 6.0127C10.1981 6.0127 10.3887 6.09158 10.5293 6.23204Z"
      :fill="color" />
  </svg>
</template>

<script setup>
import { computed } from 'vue'

const props = defineProps({
  size: {
    type: [Number, String],
    default: 24
  },
  color: {
    type: String,
    default: 'black'
  }
})

// 如果传入的是数字，则自动添加 px 单位，否则直接使用传入的字符串
const computedWidth = computed(() => {
  return typeof props.size === 'number' ? `${props.size}px` : props.size
})

// 默认 viewBox 为 24:25 的比例，若传入数字则自动按比例计算高度，否则直接使用传入值
const computedHeight = computed(() => {
  return typeof props.size === 'number' ? `${props.size * (25 / 24)}px` : props.size
})
</script>